# File type and description(statistical Info)

My data consist of 15 columns and 44269 rows
All game scores of the big five European soccer leagues (England, Germany, Spain, Italy and France) for the 1995/96 to 2019/20 seasons.

# why?

+ Analyse the evolution of football in the 5 major leagues over the last 25 years.
+ Prepare all kinds of dashboards on the games, seasons, teamsâ€¦etc.
+ Analyze the differences between countries in terms of league level.
+ Identify patterns, schemes in the data

In [1]:
import pandas as pd

In [2]:
data= data = pd.read_csv('D:\Senior\Capstone\data-science-enviroment\data\BIG FIVE 1995-2019.csv')

In [21]:
#number of rows, columns
print(data.shape)

(44269, 15)

In [17]:
#number of colums 
print(len(data.columns))

15

In [10]:
data.head()

,Round,Date,Team 1,FT,HT,Team 2,Year,Country,FT Team 1,FT Team 2,HT Team 1,HT Team 2,GGD,Team 1 (pts),Team 2 (pts)
0,1,(Sat) 19 Aug 1995 (W33),Aston Villa FC,3-1,3-0,Manchester United FC,1995,ENG,3,1,3,0,2,3,0
1,1,(Sat) 19 Aug 1995 (W33),Blackburn Rovers FC,1-0,1-0,Queens Park Rangers FC,1995,ENG,1,0,1,0,1,3,0
2,1,(Sat) 19 Aug 1995 (W33),Chelsea FC,0-0,0-0,Everton FC,1995,ENG,0,0,0,0,0,1,1
3,1,(Sat) 19 Aug 1995 (W33),Liverpool FC,1-0,0-0,Sheffield Wednesday FC,1995,ENG,1,0,0,0,1,3,0
4,1,(Sat) 19 Aug 1995 (W33),Manchester City FC,1-1,0-1,Tottenham Hotspur FC,1995,ENG,1,1,0,1,0,1,1

In [12]:
data.describe()

,Round,Year,FT Team 1,FT Team 2,HT Team 1,HT Team 2,GGD,Team 1 (pts),Team 2 (pts)
count,44269.000000,44269.000000,44269.000000,44269.000000,44269.000000,44269.000000,44269.000000,44269.000000,44269.000000
mean,18.852154,2007.006641,1.539271,1.112065,0.680137,0.477987,1.319388,1.669498,1.065960
std,10.694362,7.130475,1.282207,1.109638,0.824792,0.695605,1.187047,1.300856,1.237966
min,1.000000,1995.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,10.000000,2001.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,19.000000,2007.000000,1.000000,1.000000,0.000000,0.000000,1.000000,1.000000,1.000000
75%,28.000000,2013.000000,2.000000,2.000000,1.000000,1.000000,2.000000,3.000000,3.000000
max,42.000000,2019.000000,10.000000,9.000000,7.000000,6.000000,9.000000,3.000000,3.000000

In [15]:
#list of colums names
list(data.columns)

['Round',
 'Date',
 'Team 1',
 'FT',
 'HT',
 'Team 2',
 'Year',
 'Country',
 'FT Team 1',
 'FT Team 2',
 'HT Team 1',
 'HT Team 2',
 'GGD',
 'Team 1 (pts)',
 'Team 2 (pts)']

In [3]:
#list of colums names
list(data.size)

NameError: name 'data' is not defined